[{"_id":{"$oid":"5ccee433b67f8f1b982acdb0"},"movieName":"The Nun","movieNameThai":"เดอะ นัน","details":"When a young nun at a cloistered abbey in Romania takes her own life, a priest (Demian Bichir) with a haunted past and a novitiate on the threshold of her final vows (Taissa Farmiga) are sent by the Vatican to investigate. Together they uncover the order’s unholy secret. Risking not only their lives but their faith and their very souls, they confront a malevolent force in the form of the same demonic nun that first terrorized audiences in “The Conjuring 2,” as the abbey becomes a horrific battleground between the living and the damned.","imageUrl":"https://cdn.majorcineplex.com/uploads/movie/2226/thumb_2226.jpg","length":"96","trailer":"https://www.youtube.com/embed/pzD9zGcUNrw?autoplay=1","price":{"$numberInt":"100"},"theatre":"1","showTime":["10.00","13.00","16.00","19.00","21.00"]}
,{"_id":{"$oid":"5ccf221ae08e9e2d5c6b28e1"},"movieName":"Fantastic Beasts 2","movieNameThai":"สัตว์มหัศจรรย์ อาชญากรรมของกรินเดลวัลด์","details":"J.K. Rowling wrote the screenplay for the film, which opens in 1927, a few months after Newt helped to unveil and capture the infamous Dark wizard Gellert Grindelwald. However, as he promised he would, Grindelwald has made a dramatic escape and has been gathering more followers to his cause—elevating wizards above all non-magical beings. The only one who might be able to stop him is the wizard he once called his dearest friend, Albus Dumbledore. But Dumbledore will need help from the wizard who had thwarted Grindelwald once before, his former student Newt Scamander. The adventure reunites Newt with Tina, Queenie and Jacob, but his mission will also test their loyalties as they face new perils in an increasingly dangerous and divided wizarding world.","imageUrl":"https://cdn.majorcineplex.com/uploads/movie/2185/thumb_2185.jpg","length":"134","trailer":"https://www.youtube.com/embed/TiblmGnet2Q?autoplay=1","price":{"$numberInt":"150"},"theatre":"2","showTime":["10.00","13.30","17.00","20.30","23.30"]}
,{"_id":{"$oid":"5ccf2347e08e9e2d5c6b28e2"},"movieName":"Star Wars 7","movieNameThai":"สตาร์ วอร์ส อุบัติการณ์แห่งพลัง","details":"The beginning of a new Star Wars trilogy will take place 30 years after Episode VI: Return of the Jedi. The new films will feature \"a trio of new young leads along with some very familiar faces\"","imageUrl":"https://cdn.majorcineplex.com/uploads/movie/1011/thumb_1011.jpg","length":"136","trailer":"https://www.youtube.com/embed/sGbxmsDFVnE?autoplay=1","price":{"$numberInt":"150"},"theatre":"3","showTime":["10.00","13.30","17.00","20.30","23.30"]}
,{"_id":{"$oid":"5ccf2433b240a42d5c513261"},"movieName":"Pokemon Detective Pikachu","movieNameThai":"โปเกมอน ยอดนักสืบพิคาชู","details":"The story begins when ace private eye Harry Goodman goes mysteriously missing, prompting his 21-year-old son Tim to find out what happened. Aiding in the investigation is Harry’s former Pokémon partner, Detective Pikachu: a hilariously wise-cracking, adorable super-sleuth who is a puzzlement even to himself. Finding that they are uniquely equipped to communicate with one another, Tim and Pikachu join forces on a thrilling adventure to unravel the tangled mystery. Chasing clues together through the neon-lit streets of Ryme City—a sprawling, modern metropolis where humans and Pokémon live side by side in a hyper-realistic live-action world—they encounter a diverse cast of Pokémon characters and uncover a shocking plot that could destroy this peaceful co-existence and threaten the whole Pokémon universe.","imageUrl":"https://cdn.majorcineplex.com/uploads/movie/2533/thumb_2533.jpg","length":"104","trailer":"https://www.youtube.com/embed/1roy4o4tqQM?autoplay=1","price":{"$numberInt":"100"},"theatre":"4","showTime":["10.00","13.00","16.00","19.00","21.00"]}
,{"_id":{"$oid":"5ccf2482b240a42d5c513262"},"movieName":"Dumbo","movieNameThai":"ดัมโบ้","details":"From Disney and visionary director Tim Burton, “Dumbo” expands on the beloved classic story where differences are celebrated, family is cherished and dreams take flight. A new trailer, images and poster are now available. The trailer features Colin Farrell, Michael Keaton, Danny DeVito, Eva Green, Finley Hobbins and Nico Parker.","imageUrl":"https://cdn.majorcineplex.com/uploads/movie/2472/thumb_2472.jpg","length":"112","trailer":"https://www.youtube.com/embed/7NiYVoqBt-8?autoplay=1","price":{"$numberInt":"100"},"theatre":"5","showTime":["10.00","13.00","16.00","19.00","21.00"]}
,{"_id":{"$oid":"5cd16f93ca10550bacbc0703"},"movieName":"Avengers: Endgame","movieNameThai":"อเวนเจอร์ส เผด็จศึก","details":"After the devastating events of Avengers: Infinity War (2018), the universe is in ruins. With the help of remaining allies, the Avengers assemble once more in order to undo Thanos' actions and restore order to the universe.","imageUrl":"https://cdn.majorcineplex.com/uploads/movie/2584/thumb_2584.jpg","length":"182","trailer":"https://www.youtube.com/embed/TcMBFSGVi1c?autoplay=1","price":{"$numberInt":"200"},"theatre":"6","showTime":["10.00","14.00","16.00","20.00","23.30"]}
]